# Python 3.13.1 (tags/v3.13.1:0671451, Dec  3 2024, 19:06:28) [MSC v.1942 64 bit (AMD64)] on win32
# Type "help", "copyright", "credits" or "license()" for more information.

# =========== RESTART: C:\Users\309\Desktop\2025-python\7Weeks\Assi.py ===========
# 좋아하는 과일 이름을 입력하시오 : 키위
# 좋아하는 과일 이름을 입력하시오 : 바나나
# 좋아하는 과일 이름을 입력하시오 : 사과
# 과일의 이름을 입력하세요 : 키위
# 이 과일은 당신이 좋아하는 과일입니다.
# 서울 인구 :  9765
# 인천 인구 :  2954
# 도시 리스트 :  ['Seoul', 'Busan', 'Incheon']
# 인구 총 합계 16160
# 50 [0, 10, 20, 30, 40]
# 10 [0, 20, 30, 40]
# V
# J-Hope
# Suga
# Jungkook
# [1, 2, 3, 4, 5, 6, 7, 8, 9]
# [9, 8, 7, 6, 5, 4, 3, 2, 1]
# ['J-Hope', 'Jungkook', 'Suga', 'V']
# [1, 2, 3, 4, 5, 6, 7, 8, 9]
# [9, 6, 7, 1, 8, 4, 5, 3, 2]
# ['p', 'y', 't', 'h', 'o', 'n']
# s[0] = p
# s[1] = y
# s[-1] = n
# s[0:2] = py
# s[-2:] = on
# s[-1:-3:-1] = no
# ['23', '35', '67', '88', '1']
# ['23', '35', '67', '88', '1']
# ####################
# #    오늘의 명언    #
# ####################

# 언제나 현재에 집중할 수 있다면 행복할 것이다.
# 이 중에서 가장 작은 값은 :  164
# 이 중에서 가장 큰 값은 :  178
# 이 중에서 가장 작은 값은 :  164
# 이 중에서 가장 큰 값은 :  178
